         03 foreground-colour 15 line 2 col 63 pic x(16) from
            ws-display-date.
         03 foreground-color 1 background-color 11 VALUE
            " Operational Property Sales Tracker " LINE 2 COL 22.
         03 foreground-color 1 background-color 11 VALUE
            "  Registered Asset Tool  (OPSTRAT)  " LINE 3 COL 22.
